# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

# Formulae
brew 'git'
brew 'tree'
brew 'node'
brew 'wget'
brew 'java'
brew 'go'
brew 'python3'
brew 'mas'
brew 'aws-sam-cli'
brew 'awscli'
brew 'gradle'
brew 'maven'
brew 'micronaut'
brew 'task'
brew 'unzip'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'yarn'
brew 'starship'
brew 'make'
brew 'npm'

# Casks
cask 'brave-browser'
cask 'docker'
cask 'figma'
cask 'font-ibm-plex'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'obsidian'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'

#Check out
